Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/The Grails Framework 2.0.0 - Reference Documentation-level2.tmx
Source language: en_us
Languages: ru_ru

source: By default when you define a relationship with GORM it is a java.util.Set which is an unordered collection that cannot contain duplicates.
ru_ru: Когда вы определяете отношения в GORM это по умолчанию java.util.Set представляющий собой неупорядоченный набор, который не может содержать дубликаты.

source: Command Line
ru_ru: Командная строка

source: Composition in GORM
ru_ru: Компоновка в GORM

source: ConfigurationHolder and ApplicationHolder are deprecated and will be removed in a future version of Grails, so it is highly preferable to access the GrailsApplication and config from the grailsApplication variable.
ru_ru: ConfigurationHolder и ApplicationHolder устарели (deprecated) и в следующих версиях Grails будут удалены, поэтому крайне желательно получать доступ к GrailsApplication и настраивать через переменную grailsApplication.

source: Configuring loggers
ru_ru: Конфигурирование регистратора

source: Consider this example:
ru_ru: Рассмотрим такой пример:

source: Considerations
ru_ru: Соображения

source: Constraints
ru_ru: Ограничения

source: Controller Actions as Methods
ru_ru: Акции контроллеров как методы

source: Controllers
ru_ru: Контроллеры

source: Copies of this document may be made for your own use and for distribution to others, provided that you do not charge any fee for such copies and further provided that each copy contains this Copyright Notice, whether distributed in print or electronically.
ru_ru: Копии этого документа могут быть сделаны для Вашего собственного использования и для распространения другим лицам, при условии, что Вы не берёте плату за такие копии, и далее при условии, что каждая копия содержит это Уведомление об авторском праве, распространяется ли это в печати или в электронном виде.

source: Core Features
ru_ru: Особенности ядра

source: Core Grails targets
ru_ru: Основные цели Grails

source: Creating Artefacts
ru_ru: Создание артефактов

source: Creating Gant Scripts
ru_ru: Создание скриптов Gant

source: Customizable URL Formats
ru_ru: Настраиваемые форматы URL

source: Database Mapping
ru_ru: Связывание баз данных

source: Database Migrations
ru_ru: Миграция баз данных

source: Database Reverse Engineering
ru_ru: Обратный инжиниринг баз данных

source: Dependency Resolution Improvements
ru_ru: Улучшение решения зависимостей

source: Dependency injection with the inbuilt Spring container
ru_ru: Внедрение зависимостей со встроенным контейнером Spring.

source: Detached Criteria and Where Queries
ru_ru: Обособленные критерии и Where запросы

source: Development Environment Features
ru_ru: Особенности среды разработки

source: Domain Classes
ru_ru: Доменные классы

source: Domain Modelling in GORM
ru_ru: Моделирование Доменов в GORM

source: Domain classes are core to any business application.
ru_ru: Доменные классы это основа любого бизнесс приложения.

source: Domain classes have support for the findOrCreateWhere, findOrSaveWhere, findOrCreateBy and findOrSaveBy query methods which behave just like findWhere and findBy methods except that they should never return null.
ru_ru: В доменных классах есть поддержка методов запросов findOrCreateWhere, findOrSaveWhere, findOrCreateBy и findOrSaveBy которые ведут себя как методы findWhere и findBy, исключая, что они никогда не должны возвращать NULL.

source: Don't worry too much about the syntax using a class, it's quite specialised.
ru_ru: Не беспокойтесь слишком много о синтаксисе использования класса, он полностью специализирован.

source: Downloading and Installing
ru_ru: Загрузка и установка

source: Dynamic frameworks like Rails, Django and TurboGears helped pave the way to a more modern way of thinking about web applications.
ru_ru: Динамические каркасы, такие как Rails, Django и TurboGears помогли проложить путь к более современным способам мышления о веб-приложениях.

source: Each of the above levels apart from 'off' and 'all' have a corresponding log method of the same name.
ru_ru: Каждый уровень кроме 'off' и 'all' имеет свой собственный метод протоколирования с тем же самым именем.

source: Each property is mapped to a column in the database, where the convention for column names is all lower case separated by underscores.
ru_ru: Каждое свойство отображается в базе данных в колонках, имена которых по соглашению об именах колонок, все в нижнем регистре и разделены подчеркиванием.

source: Easy Date Parsing
ru_ru: Простой парсинг дат

source: Enhanced Error Reporting and Diagnosis
ru_ru: Улучшение отчетов об ошибках и диагностики

source: Error reporting and problem diagnosis has been greatly improved with a new errors view that analyses stack traces and recursively displays problem areas in your code:
ru_ru: Сообщения об ошибке и диагностика проблемм были значительно улучшены с новым представлением ошибок, которое анализирует трассировку стека и рекурсивно выводит на экран проблемные области в коде:

source: Even better, the open command understands the logical aliases 'test-report' and 'dep-report', which will open the most recent test and dependency reports respectively.
ru_ru: Даже лучше, команда open понимает логические псевдонимы 'test-report' и 'dep-report', которые откроют последний тест и последний отчет зависимостей соответственно.

source: Example A
ru_ru: Пример A

source: Example B
ru_ru: Пример B

source: Example C
ru_ru: Пример C

source: Example:
ru_ru: Например:

source: Examples: grails dev run-app grails create-app books
ru_ru: Примеры: grails dev run-app grails create-app books

source: Filter Exclusions
ru_ru: Фильтры исключений

source: Filters may now express controller, action and uri exclusions to offer more options for expressing to which requests a particular filter should be applied.
ru_ru: Теперь фильтры могут напрямую указывать контроллеры, акции и URI, к запросам которых должен быть применен определенный фильтр.

source: Finally, it's a good idea to add a unique constraint on one side of the one-to-one relationship:
ru_ru: И в заключение, хорошо бы добавить ограничение уникальности на одной из сторон отношений один-к-одному:

source: First of all, you have to understand how levels work.
ru_ru: Прежде всего, вы должны понимать, как работают уровни.

source: For a start, what are they?
ru_ru: Для начала, что это такое?

source: For backwards compatibility a Prototype plugin is available.
ru_ru: Плагин Prototype доступен для обеспечения обратной совместимости.

source: For example releaseDate maps onto a column release_date.
ru_ru: Например, свойство releaseDate отобразится в колонке release_date.

source: For example consider the following code:
ru_ru: Например рассмотрим следующий код:

source: For example given the following form:
ru_ru: Например, возмем следующую форму:

source: For example if you need to generate links in a service or an asynchronous background job outside the scope of a request:
ru_ru: Например, если вам нужно сгенерировать ссылку в службе или в асинхронном фоновом задании вне контекста запроса:

source: For example if you were building an Amazon-style bookstore you would be thinking about books, authors, customers and publishers to name a few.
ru_ru: Например, если вы создаете книжный магазин в стиле Amazon вы должны подумать о книгах, авторах, покупателях и издателях и многих других.

source: For example the following command:
ru_ru: Например такая команду:

source: For example this will work and cascade saves:
ru_ru: Например, это будет работать и сохранять каскадно:

source: For example using the list method on the Content super class will return all subclasses of Content:
ru_ru: Например, использование метода list суперкласса Content будет возвращать все подклассы Content:

source: For example when running with a custom Grails environment called "production", a Spring profile of "production" is activated so that you can use Spring's bean configuration APIs to configure beans for a specific profile.
ru_ru: Например, когда пользователь запускает среду Grails с профилем "production", активируется аналогичный профиль Spring, так что вы можете использовать API конфигурации Spring's bean для настройки определенного профиля.

source: For example, if you have an 'org.example.domain' logger configured like so:
ru_ru: Например, если вы захотите настроить регистратор 'org.example.domain' вот так:

source: For example, if you have this service:
ru_ru: Например, если у вас есть такая служба:

source: For example, the following class creates a nicknames association that is a Set of String instances:
ru_ru: Например, в следующем классе создается ассоциация nicknames которая является Set экземпляров типа String:

source: For example, the method log.error(msg) will log a message at the 'error' level.
ru_ru: Например, метод log.error(msg) будет регистрировать сообщение на уровне 'error'.

source: For example:
ru_ru: Например

source: For general configuration Grails provides a file called grails-app/conf/Config.groovy.
ru_ru: В основном конфигурация Grails обеспечивается файлом grails-app/conf/Config.groovy.

source: For more information on the new features of the console refer to the section of the user guide that covers the console and interactive mode.
ru_ru: Для более подробной информации о новых возможностях консоли перейдите в раздел инструкции, которая охватывает консоль и интерактивный режим.

source: For more information on using these options, see the section on deployment
ru_ru: Для более подробной информации об использовании этойопции смотри раздел deployment

source: For more information see the section on Multiple Data Sources in the user guide.
ru_ru: Для более подробной информации см. раздел Multiple Data Sources руководства пользователя.

source: For more information see the section on Sets, Lists and Maps in the user guide.
ru_ru: Для более подробной информации см. раздел Наборы, Списки и Карты руководства пользователя.

source: For other classes, the typical approach is to store a logger based on the class name in a constant static field:
ru_ru: Для других классов, типичным подходом является сохранение регистратора в постоянном статическом поле на основе имени класса:

source: GORM is Grails' object relational mapping (ORM) implementation.
ru_ru: GORM это Grails' реализация объектно-реляционного сопоставления (ORM).

source: GORM now supports abstract inheritance trees which means you can define queries and associations linking to abstract classes:
ru_ru: Теперь GORM поддерживает деревья абстрактных наследований, что означает, что вы можете определять запросы и ассоциированные ссылки на абстрактные классы:

source: GORM supports inheritance both from abstract base classes and concrete persistent GORM entities.
ru_ru: GORM поддерживает наследование как от абстрактных базовых классов, так и от конкретных персистентных сущностей GORM.

source: GORM will map an association like the above using a join table.
ru_ru: GORM будет как и прежде отображать ассоциацию используя присоединенную таблицу.

source: Gant lets you pull in all targets (except "default") from another Gant script.
ru_ru: Gant позволяет вам получать все цели (за исключением "default") из других скриптов Gant.

source: Given an Author with a large number of associated Book instances if you were to write code like the following you would see an impact on performance:
ru_ru: Возмите класс Author с большим количеством связанных экземпляров Book, и если вы захотите написать код, подобный следующему, вы увидите влияние на производительность:

source: Grails 2.0 comes with Groovy 1.8 which includes many new features and enhancements
ru_ru: Grails 2.0 поставляется вместе с Groovy 1.8, который содержит много новых функций и улучшений

source: Grails 2.0 even provides a migrate-docs command to aid you in migrating existing gdoc user guides.
ru_ru: Grails 2.0 даже предоставляет команду migrate-docs чтобы помочь вам в переносе существующих файлов gdoc вашего руководства пользователя.

source: Grails 2.0 features brand new console output that is more concise and user friendly to consume.
ru_ru: Особенностью Grails 2.0 является новый консольный вывод, который стал более краток и удобный для использования.

source: Grails 2.0 features support for DetachedCriteria which are criteria queries that are not associated with any session or connection and thus can be more easily reused and composed:
ru_ru: Функциональные возможности Grails 2.0 поддерживают DetachedCriteria которые являются запросами критериев, не связаных ни с одним сеансом или соединением и таким образом могут быть более легко скомпонованы и повторно использованы:

source: Grails 2.0 is now built on Hibernate 3.6
ru_ru: Теперь Grails 2.0 основан на Hibernate 3.6

source: Grails 2.0 now uses the H2 database instead of HSQLDB, and enables the H2 database console in development mode (at the URI /dbconsole) so that the in-memory database can be easily queried from the browser:
ru_ru: Grails 2.0 теперь использует базу данных H2 вместо HSQLDB, и включает консоль базы данных H2 в режиме разработки (по URI-адресу /dbconsole) так, чтобы база данных в памяти могла быть легко запрошена из браузера:

source: Grails 2.0 reloading mechanism no longer uses class loaders, but instead uses a JVM agent to reload changes to class files.
ru_ru: Механизм загрузки Grails 2.0 больше не испльзует загрузчик классов, но вместо этого использует агента JVM для загрузки измененных файлов классов.

source: Grails allows for the customization of this pattern and provides an implementation which replaces the camel case convention with a hyphenated convention that would support URLs like /math-helper/add-numbers.
ru_ru: Grails позволяет настраивать этот шаблон и обеспечивает реализацию которая заменяет соглашение о верблюжьем стиле соглашением о стиле написания через дефис, которое будет поддерживать написание URL типа /math-helper/add-numbers.

source: Grails also provides the following configuration options:
ru_ru: Grails обеспечивает следующие опции конфигурации:

source: Grails automatically binds a Hibernate session to the currently executing request.
ru_ru: Grails автоматически связывает сессию Hibernate с выполняемым в настоящий момент запросом.

source: Grails builds on these concepts and dramatically reduces the complexity of building web applications on the Java platform.
ru_ru: Grails основан на этих понятиях и значительно уменьшает сложность создания веб-приложений на платформе Java.

source: Grails is a full stack framework and attempts to solve as many pieces of the web development puzzle through the core technology and its associated plugins.
ru_ru: Grails это полновесный каркас, который пытается решить головоломку веб разработки при помощи своих основных технологий и связанных плагинов.

source: Grails maps a many-to-many using a join table at the database level.
ru_ru: На уровне базы данных Grails сопоставляет многие-ко-многим используя присоединенные таблицы.

source: Grails now makes a best effort to cache the previous resolve and avoid resolving again unless you change BuildConfig.groovy.
ru_ru: Grails теперь делает максимальные усилия, чтобы кэшировать предыдущее решение и избегает решать снова, если вы не изменяете BuildConfig.groovy .

source: Grails now supports Servlet 3.0 including the Asynchronous programming model defined by the specification:
ru_ru: Теперь Grails поддерживает Servlet 3.0 включая асинхронную модель программирования, определенную спецификацией:

source: Grails plugins can now be packaged as JAR files and published to standard maven repositories.
ru_ru: Плагины Grails теперь могут быть упакованы как файлы JAR и опубликованы в стандартных репозитариям Мaven.

source: Grails searches in the following directories for Gant scripts to execute:
ru_ru: Grails ищет выполняемые скрипты Gant в следующих директориях:

source: Grails ships with a lot of command line functionality out of the box that you may find useful in your own scripts (See the command line reference in the reference guide for info on all the commands).
ru_ru: Grails из коробки поставляется с большой функциональностью командной строки, которая может оказаться полезной в ваших собственных скриптах (для подробной информации обо всех командах смотри ссылку "командная строка" в справочнике).

source: Grails ships with an embedded servlet container and in-memory H2 database, so there isn't even a database to set up.
ru_ru: Grails поставляется со встроенным servlet container и in-memory H2 базой данных, так что даже не надо устанавливать никакую базу данных.

source: Grails supports many-to-many relationships by defining a hasMany on both sides of the relationship and having a belongsTo on the owned side of the relationship:
ru_ru: Grails поддерживает отношения многие-ко-многим определяя hasMany на обеих сторонах отношения, и belongsTo на принадлежащей стороне:

source: Grails transparently adds an implicit id property to your domain class which you can use for retrieval:
ru_ru: Grails прозрачно добавит неявное свойство id к вашему доменному классу когда вы будете использовать поиск:

source: Grails uses its common configuration mechanism to provide the settings for the underlying Log4j log system, so all you have to do is add a log4j setting to the file grails-app/conf/Config.groovy.
ru_ru: Grails использует свой собственный конфигурационный механизм для обеспечения настроек лежащей в его основе системы протоколирования Log4j , все что вам нужно сделать, это добавить настройки log4j в файл grails-app/conf/Config.groovy.

source: Grails will also convert command names that are in lower case form such as run-app into camel case.
ru_ru: Также Grails будет преобразовывать имя команды, написаное в нижнем регистре, такое как "run-app", в имя, написанное в верблюжьем стиле.

source: Grails will automatically inject a property of type java.util.Set into the domain class based on the hasMany setting.
ru_ru: Основываясь на свойстве hasMany, Grails будет автоматически внедрять свойство типа java.util.Set в доменные классы.

source: Grails will, by default, map this kind of relationship with a join table.
ru_ru: По умолчанию, Grails будет сохранять эти виды отношений в присоедененной таблице.

source: Grails' Scaffolding feature does not currently support many-to-many relationship and hence you must write the code to manage the relationship yourself
ru_ru: Функция Grails' Scaffolding в настоящий момент не поддерживает отношения "многие-ко-многим" и следовательно, вы сами должны написать код для управления отношениями.

source: Grails' command line system is built on Gant - a simple Groovy wrapper around Apache Ant.
ru_ru: Система командной строки Grails основана на Gant - простой Groovy оболочки вокруг Apache Ant.

source: Grails' existing environment support has been bridged into the Spring 3.1 profile support.
ru_ru: Существующая поддержка среды Grails была обьеденена с поддежкой профиля Spring 3.1.

source: H2 Database and Console
ru_ru: База данных H2 и консоль

source: HTML5 Scaffolding
ru_ru: Скаффолдинг в стиле HTML5

source: Here's a basic example:
ru_ru: Вот простой пример:

source: Hibernate batches up SQL statements and executes them as late as possible, often at the end of the request when flushing and closing the session.
ru_ru: Hibernate группирует выражения SQL и выполняет их как можно позже, часто в конце запроса, когда сессия сбрасывается и закрывается.

source: Hibernate caches database updates where possible, only actually pushing the changes when it knows that a flush is required, or when a flush is triggered programmatically.
ru_ru: Hibernate когда возможно, кэширует обновления базы данных, вводя только действительные изменения, когда он знает, что требуется сброс, или когда сброс срабатывает программно.

source: Hibernate then initializes the proxied instance, or throws an exception if no record is found for the specified id.
ru_ru: Hibernate инициализирует проксированный экземпляр, или выбросит исключение, если для определенного id не будет никаких записей.

source: How do you configure them?
ru_ru: Как их настроить?

source: However in many cases you will want to manually configure the location of Java.
ru_ru: Однако, в большинстве случаев вы должны вручную настроить расположение Java.

source: However this will only save the Book and not the authors!
ru_ru: Однако это будет сохранять только Book а не Author!

source: However, Grails takes it further through the use of convention and the grails command.
ru_ru: Тем не менее, Grails идет дальше, используя соглашения и команду grails.

source: However, excessive use of inheritance and table-per-subclass can result in poor query performance due to the use of outer join queries.
ru_ru: Однако чрезмерное использование наследования и таблица-на-подкласс может привести к снижению производительности запросов в связи с использованием внешнего объединения запросов.

source: However, typically you should configure a more robust database at some point and that is described in the following section.
ru_ru: Однако, в какой-то момент вам нужно будет настроить более надежную базу данных, как описывается в следующем разделе.

source: If Grails finds a bean in the context with that name, it will be used as the default converter and there is no need to assign a value to the grails.web.url.converter config property.
ru_ru: Если Grails найдет в контексте бин с таким именем, он будет использовать его как конвертер по умолчанию и это не потребует присваивания значения свойству grails.web.url.converter.

source: If a matching instance cannot be found in the database then a new instance is created, populated with values represented in the query parameters and returned.
ru_ru: Если соответствующий экземпляр не может быть найден, создается и возвращается новый экземпляр с заполненными значениями свойств из параметров запроса.

source: If multiple datasources are specified for a domain then you can use the name of a particular datasource as a namespace in front of any regular GORM method:
ru_ru: Если множественные источники данных определены для домена тогда, можете использовать имя определенного источника данных как пространство имен перед любым регулярным методом GORM:

source: If multiple matches are found Grails will give you a choice of which one to execute.
ru_ru: Если найдено несколько соответствий, Grails даст вам один из них на выбор.

source: If no package is specified with the create-domain-class script, Grails automatically uses the application name as the package name.
ru_ru: Если не указан ни какой пакет, Grails автоматически использует имя приложения как имя пакета.

source: If ordering and uniqueness aren't a concern (or if you manage these explicitly) then you can use the Hibernate Bag type to represent mapped collections.
ru_ru: Если упорядочивание и уникальность не имеют значения (или если вы явно управляете этим) то вы должны использовать Hibernate тип Bag для представления отображаемой коллекции.

source: If there is no default, Grails will quit with an error.
ru_ru: Если нет цели по умолчанию, Grails выйдет с ошибкой.

source: If you are coming from a background of using ActiveRecord or iBatis Hibernate's "session" model may feel a little strange.
ru_ru: Если вы раньше использовали ActiveRecord или iBatis, модель сессии Hibernate может показаться немного странной.

source: If you define the Address class in a separate Groovy file in the grails-app/domain directory you will also get an address table.
ru_ru: Если вы определяете класс Address в отдельном файле Groovy в директории grails-app/domain вы также получите таблицу address.
